2 + 2
4 - 1
4 * 3
5 / 2
13 %/% 2 #деление с остатком
13 %% 2 #остаток от деления
5 ^ 2 # рекомендуется писать так
5 ** 2 # не ренкомендуется писать так

((2 + 2) * 2) - 2
-2 * 5 #более читаемо (считается)
-2*5 #менее читаемо

16 ^ 0.5
16 ^ 1 / 2
16 ^ (1/2)

sqrt(16)
#SQRT(16) #R -- это case-sensitive язык
sqrt(16)

log(8)

log(x = 8, base = 2)
log(8, 2)
log(8, sqrt(4))
?`+`
# `+`(4, 5)
4 + 5

sin(pi)
options(scipen = 999)
sin(pi)
options(scipen = 7)
sin(pi)
2 ^ 100
options(scipen = 999)
2 ^ 100
sin(pi)

#sqrt(2)^2 == 2
